apiurlcomparison/baselines/m1/20260124/run-003/iteration-004/request.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="http://raks.com/orderservice">
  <soap:Body>
    <tns:CreateOrderRequest>
      <customerName>rio</customerName>
      <customerEmail>john.doe@example.com</customerEmail>
      <orderDate>2026-01-18</orderDate>
      <productName>rio</productName>
      <quantity>5</quantity>
      <totalAmount>20</totalAmount>
    </tns:CreateOrderRequest>
  </soap:Body>
</soap:Envelope>